print("""Напишите программу, которая определяет, является число четным или нечетным.""")

a = input()
b = input()
if a == b:
    print('Пароль принят')
if a != b:
    print('Пароль не принят')